OpenFOAM-3.0.1/chapter5/propeller/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 5;

vertices
(
    (-10 -10 -15)
    (10 -10 -15)
    (10 10 -15)
    (-10 10 -15)

    (-10 -10 35)
    (10 -10 35)
    (10 10 35)
    (-10 10 35)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
	 (4 5 6 7)          
        );
    }

    inlet    
    {
        type patch;
        faces
        (
	(0 3 2 1)
        );
    }

    sides
    {
        type patch;
        faces
        (
	    (0 4 7 3)
	    (2 6 5 1)    
	    (1 5 4 0)	
	    (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
